// Дано число. Ділить його на 2 стільки разів,
// поки результат поділу не стане меншим за 20. Виведіть це число.
// Порахуйте кількість ітерацій,
// і запишіть їх у змінну num.
// і якщо 20 ділиться без остатку на кількість ітерацій, виведіть "гарне число"
// інакше виведіть кількість ітерацій

let number = 340;
let num = 0;

do {
    number /= 2;
    num ++;
} while (number > 20);

console.log('к-сть ітерацій: ', num);

let result = 20 % num === 0
? 'гарне число' : 'погане число';

console.log(result);

